PGM
DCL VAR(&N) TYPE(*DEC) LEN(5 0) VALUE(0)
DCL VAR(&PGM) TYPE(*CHAR) LEN(10)
IF COND(&N *LT 3) THEN(DO)
DOWHILE COND(&N *LT 3)
CHGVAR VAR(&N) VALUE(&N + 1)
ENDDO
ENDDO
ELSE CMD(DO)
CALL PGM(LIB1/FAIL)
ENDDO
SBMJOB CMD(CALL PGM(LIB1/BATCH) PARM(&N)) JOB(TEST)
OVRDBF FILE(INPUT) TOFILE(LIB1/DATA) MBR(*FIRST) OVRSCOPE(*JOB)
SNDPGMMSG MSG('It''s CONT+
 INUED')
CALL PGM(&PGM)
MONMSG MSGID(CPF0000) EXEC(CHGVAR VAR(&N) VALUE(-1))
ENDPGM
