     A          R SCREEN                    OVERLAY                             
     A            NAME          20A  B  3 10CHECK(ME) DSPATR(UL)                
     A                                  1  2'Customer''s +                      
     A                                         Details'                         
