     A          R CUSTOMER                  PFILE(LIB1/CUSTOMER)                
     A            ID                                                            
     A          K ID                        DESCEND                             
